Revit 2027 API
FamilyInstance.MEPModel Property
Retrieves the MEP model for the family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPModel MEPModel { get; }
Public ReadOnly Property MEPModel As MEPModel
	Get
public:
property MEPModel^ MEPModel {
	MEPModel^ get ();
}
member MEPModel : MEPModel with get
Property Value
MEPModel
Remarks
If the family instance has a MEP model it is returned by this method, otherwise null is returned. Different types of MEP model will be returned based on the type of the instance, for example - if the instance is a lighting device then a lighting device model will be returned. This property will only function with the Autodesk Revit MEP product.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace